{
  "numberedTexts": [
    "The quarterly earnings report showed revenue of $2.4 billion, representing a 12.7% increase from the previous year's $2.13 billion. Operating expenses totaled $1.85 billion, resulting in a net profit margin of 22.9%.",
    "The S&P 500 index closed at 4,327.16 points on Friday, gaining 1.8% for the week. Technology stocks led the rally, with Apple (AAPL) rising 3.2% to $182.45 and Microsoft (MSFT) climbing 2.9% to $334.78.",
    "The Federal Reserve announced a 0.25% interest rate increase, bringing the federal funds rate to 5.25-5.50%. This marks the 11th rate hike since March 2022, as policymakers continue efforts to combat inflation.",
    "The James Webb Space Telescope captured images of galaxy JADES-GS-z13-0, located approximately 13.4 billion light-years from Earth. The galaxy formed just 325 million years after the Big Bang, when the universe was only 2.4% of its current age.",
    "Laboratory results indicate that the new compound exhibits 94.7% efficacy in clinical trials involving 1,847 participants. The treatment group showed significant improvement compared to the placebo group (p < 0.001, 95% CI: 0.89-0.98).",
    "The Large Hadron Collider operates at energies up to 13.6 TeV, accelerating protons to 99.9999991% the speed of light. The machine consists of 1,232 dipole magnets, each 15 meters long and weighing 35 tons.",
    "The new processor features 16 cores running at base frequencies of 3.2 GHz, with boost clocks reaching 5.1 GHz. Built on a 5nm process node, it contains 19.2 billion transistors across a die area of 208 mm².",
    "Data center capacity reached 2.7 exabytes globally in 2023, with hyperscale facilities accounting for 67% of total storage. Power consumption averaged 1.2 MW per facility, with PUE ratios improving to 1.18.",
    "The autonomous vehicle completed 50,000 miles of testing with 99.97% accuracy in object detection. The system processes 2.3 TB of sensor data daily using 8 NVIDIA A100 GPUs running at 400 watts each.",
    "Census data reveals that 68.4% of households own their homes, with median property values of $347,500. The homeownership rate varies significantly by age group: 37.1% for ages 25-34, 69.8% for ages 35-44, and 82.3% for ages 65+.",
    "The metropolitan area population reached 4.2 million residents in 2023, growing at an annual rate of 1.8%. Population density averages 2,847 people per square mile, with the urban core reaching 12,500 people per square mile.",
    "Educational attainment statistics show that 35.7% of adults hold bachelor's degrees, 13.2% have master's degrees, and 2.1% possess doctoral degrees. Median household income correlates strongly with education level: $45,200 for high school, $78,900 for bachelor's, and $94,300 for advanced degrees.",
    "The cryptocurrency market capitalization reached $2.8 trillion in November 2021, with Bitcoin (BTC) accounting for 42.3% at $68,789 per coin. Ethereum (ETH) held 19.1% market share at $4,891, while the top 10 cryptocurrencies represented 78.6% of total market value.",
    "Climate data shows global average temperatures have increased by 1.1°C since pre-industrial times, with atmospheric CO2 levels reaching 421.13 ppm in May 2023. Arctic sea ice is declining at a rate of 13.1% per decade, while sea levels rise 3.4 mm annually.",
    "The International Space Station orbits Earth at an altitude of 408 kilometers, traveling at 27,600 km/h and completing 15.5 orbits daily. The station weighs 420 tons and has a pressurized volume of 916 cubic meters across 6 sleeping quarters.",
    "Financial markets showed volatility with the VIX index reaching 28.7 during the March selloff. The 10-year Treasury yield fluctuated between 3.88% and 5.02%, while the dollar index (DXY) traded in a range of 99.58 to 114.78.",
    "Renewable energy capacity increased by 295 GW globally in 2022, with solar photovoltaic accounting for 191 GW (64.7%) and wind power adding 77 GW (26.1%). Total renewable capacity reached 3,372 GW, representing 38.4% of global power generation.",
    "The human genome contains approximately 3.2 billion base pairs across 23 chromosome pairs, with protein-coding genes numbering around 20,000-25,000. Each cell contains 6 billion DNA base pairs, and if stretched end-to-end, would measure 2 meters in length.",
    "Artificial intelligence training costs have skyrocketed, with GPT-4 estimated to cost $100 million to train using 25,000 NVIDIA A100 GPUs over 90-100 days. The model contains 1.76 trillion parameters and requires 8 GPUs for inference at 50 tokens per second.",
    "Ocean depths reach a maximum of 11,034 meters at Challenger Deep in the Mariana Trench. The average ocean depth is 3,688 meters, with water pressure increasing by 1 atmosphere every 10 meters. Ocean volume totals 1.386 billion cubic kilometers.",
    "The Boeing 747-8F has a maximum takeoff weight of 447,700 kg and can carry a payload of 140 tons over 8,130 kilometers. Its four engines produce 296 kN of thrust each, enabling a cruise speed of Mach 0.845 at 35,000 feet altitude.",
    "Quantum computers achieved quantum supremacy with Google's Sycamore processor performing a calculation in 200 seconds that would take classical supercomputers 10,000 years. The system uses 70 superconducting qubits operating at 15 millikelvin.",
    "The Hubble Space Telescope has observed objects up to 13.4 billion light-years away, capturing images with its 2.4-meter primary mirror. Operating for 33 years, it has made over 1.5 million observations and traveled more than 4.5 billion kilometers.",
    "Global internet traffic reached 4.8 zettabytes in 2022, with video streaming accounting for 82.5% of all consumer internet traffic. Mobile data usage grew 36% year-over-year, while 5G connections increased to 1.05 billion worldwide.",
    "The Tesla Model S Plaid accelerates from 0-60 mph in 1.99 seconds with a top speed of 200 mph. Its tri-motor setup produces 1,020 horsepower, while the 100 kWh battery pack provides 405 miles of EPA-estimated range.",
    "Nuclear power plants generate electricity with 92.5% capacity factor, the highest among all energy sources. A typical 1,000 MW reactor produces 8.76 TWh annually, enough to power 876,000 homes while avoiding 6.24 million tons of CO2 emissions.",
    "The human brain consumes 20% of the body's total energy despite weighing only 2% of body mass. It contains 86 billion neurons with 100 trillion synaptic connections, processing information at speeds up to 120 meters per second.",
    "Commercial aviation safety improved dramatically with only 0.11 accidents per million flights in 2022. Modern aircraft like the Airbus A350 achieve fuel efficiency of 2.9 liters per 100 passenger-kilometers, while engines operate at 40% thermal efficiency.",
    "The Panama Canal handles 6% of global trade, with 14,239 vessel transits in fiscal year 2022. The expanded canal accommodates ships up to 366 meters long and 49 meters wide, carrying up to 14,000 TEU containers through its 77-kilometer length.",
    "Semiconductor manufacturing at 3nm process nodes achieves transistor densities of 292 million per square millimeter. TSMC's 3nm process reduces power consumption by 35% compared to 5nm while improving performance by 10-15% at the same power level.",
    "The Atacama Large Millimeter Array (ALMA) consists of 66 radio antennas operating at altitudes of 5,000 meters. The array can detect signals as weak as 10^-18 watts and achieve angular resolution of 0.01 arcseconds at 650 GHz frequency.",
    "Global smartphone shipments totaled 1.21 billion units in 2022, with Android holding 71.8% market share versus iOS at 27.6%. The average selling price increased to $322, while 5G-enabled devices represented 51.9% of all shipments.",
    "Wind turbines have grown significantly in size, with offshore models reaching 15 MW capacity and rotor diameters of 236 meters. Hub heights extend to 150 meters, while blade tip speeds reach 90 meters per second in 25 m/s winds.",
    "The Large Synoptic Survey Telescope will capture 20 TB of data nightly, imaging the entire visible sky every 3 days. Its 3.2-gigapixel camera will detect objects as faint as magnitude 24.5 over a 9.6 square degree field of view.",
    "Fiber optic cables transmit data at 99.7% the speed of light through glass with attenuation of 0.2 dB per kilometer. Modern systems achieve 100 Tbps capacity over single fibers using 150 wavelength channels with 64-QAM modulation.",
    "The Burj Khalifa stands 828 meters tall with 163 floors above ground and 46 maintenance levels in the spire. Its foundation extends 50 meters deep, using 330,000 cubic meters of concrete and 39,000 tons of steel reinforcement.",
    "Magnetic resonance imaging (MRI) scanners operate at magnetic field strengths of 1.5-7 Tesla, which is 30,000-140,000 times stronger than Earth's magnetic field. Ultra-high field 11.7T systems achieve spatial resolution of 25 micrometers.",
    "The International Thermonuclear Experimental Reactor (ITER) will generate 500 MW of fusion power from 50 MW of input heating. The tokamak weighs 23,000 tons with superconducting magnets producing 11.8 Tesla magnetic fields at -269°C.",
    "Modern CPUs contain up to 57.7 billion transistors on 815 mm² dies manufactured at 4nm process nodes. Cache hierarchies include 32 KB L1, 1 MB L2, and 64 MB L3 caches with access latencies of 1, 12, and 40 cycles respectively.",
    "The Antonov An-225 Mriya had a maximum takeoff weight of 640 tons and could carry 250 tons of cargo over 4,000 kilometers. Its six turbofan engines produced 229 kN thrust each, while the wingspan measured 88.4 meters.",
    "Particle accelerators like the LHC consume 1.3 TWh annually, equivalent to a city of 300,000 people. The 27-kilometer tunnel contains 9,300 superconducting magnets operating at 1.9 Kelvin and requiring 700,000 liters of liquid helium.",
    "Global data creation reached 97 zettabytes in 2022, growing at 23% annually. Enterprise data storage systems achieve 99.999% availability with recovery time objectives under 15 minutes and recovery point objectives under 1 hour.",
    "The human eye can detect single photons and distinguish 10 million colors across wavelengths from 380-750 nanometers. Retinal photoreceptors include 6 million cones and 120 million rods with quantum efficiency reaching 67% at 507 nm.",
    "Supercomputers like Frontier achieve 1.1 exaflops performance using 8.7 million CPU cores and consuming 21 MW of power. The system contains 9.2 PB of memory and 700 PB of storage across 74 cabinets weighing 8,000 tons total.",
    "The Suez Canal handles 12% of global trade with 20,649 vessel transits in 2022. The 193-kilometer waterway generates $7 billion annually in revenue, while the 2021 Ever Given blockage cost global trade $9.6 billion daily.",
    "Modern jet engines achieve bypass ratios of 12:1 and thermal efficiency of 45%. The GE9X engine produces 470 kN thrust while weighing 6.8 tons, with fan diameters of 3.35 meters and pressure ratios reaching 60:1.",
    "Optical atomic clocks achieve precision of 1 second in 15 billion years, measuring time with fractional frequency uncertainty of 6×10^-19. These systems use 698 nm laser light to probe strontium atoms trapped at 1 microkelvin.",
    "The Global Positioning System consists of 31 satellites orbiting at 20,200 km altitude with 12-hour periods. Each satellite carries cesium and rubidium atomic clocks accurate to 1 nanosecond, enabling positioning accuracy within 3 meters.",
    "Photovoltaic cells achieve 26.7% efficiency in laboratory conditions and 22.8% in commercial modules. Perovskite-silicon tandem cells reach 33.7% efficiency, while concentrated photovoltaics achieve 47.1% using multi-junction designs.",
    "The human heart beats approximately 100,000 times daily, pumping 7,500 liters of blood through 96,000 kilometers of blood vessels. Cardiac output averages 5 liters per minute, with stroke volume of 70 ml at 70 beats per minute."
  ]
}